//  Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго. 

// a = 25, b =  5 -> да


// Console.WriteLine("Введите первое число");
// string numberString1 = Console.ReadLine()!;
// int number1 = int.Parse(numberString1);

// Console.WriteLine("Введите второе число");
// string numberString2 = Console.ReadLine()!;
// int number2 = int.Parse(numberString2);

// if (number2 == number1 / number2)
//    {
//     Console.WriteLine("да");
//    }
// else
// {
//     Console.WriteLine("нет");
// }




// Console.WriteLine("Введите первое число");
// string numberString1 = Console.ReadLine()!;
// int number1 = int.Parse(numberString1);

// Console.WriteLine("Введите второе число");
// string numberString2 = Console.ReadLine()!;
// int number2 = int.Parse(numberString2);

// if (number2 == number1/number2)
// {
//     Console.WriteLine("да");
// }
// else
// {
// Console.WriteLine("нет");
// }





Console.WriteLine("Введите первое число");
string numberstring1 = Console.ReadLine()!;
int number1 = int.Parse(numberstring1);

Console.WriteLine("Введите второе число");
string numberstring2 = Console.ReadLine()!;
int number2 = int.Parse(numberstring2);

if (number2 == number1/number2)
{
Console.WriteLine("yes");
}

else 
{
    Console.WriteLine("no");
}
